outpost-os/drv-stm32-ltdc/src/stm32_ltdc_defs.h
// SPDX-License-Identifier: Apache-2.0

/*
 * Copyright 2023 Ledger SAS
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/*
 * XXX:
 *  !!!! Generated header, DO NOT EDIT !!!!
 */
#ifndef __STM32U599_LTDC_DEFS_H
#define __STM32U599_LTDC_DEFS_H

#include <assert.h>
#include <inttypes.h>

/**
 *  @brief LTDC SSCR register
 *
 * LTDC synchronization size configuration register
 *
 *  @note offset: 0x8UL
 *        width:  32 bits
 */
#define LTDC_SSCR_REG  0x8UL

/**
 * @brief LTDC SSCR VSH field
 *
 * vertical synchronization height (in units of horizontal scan line) These bits define the vertical Synchronization height minus 1. It represents the number of horizontal synchronization lines.
 *
 * @note offset: 0x0UL
 *       width:  11
 *       access: read-write
 */
#define LTDC_SSCR_VSH_SHIFT 0x0UL
#define LTDC_SSCR_VSH_MASK (((1ULL << 11) - 1) << LTDC_SSCR_VSH_SHIFT)
/**
 * @brief LTDC SSCR HSW field
 *
 * horizontal synchronization width (in units of pixel clock period) These bits define the number of Horizontal Synchronization pixel minus 1.
 *
 * @note offset: 0x10UL
 *       width:  12
 *       access: read-write
 */
#define LTDC_SSCR_HSW_SHIFT 0x10UL
#define LTDC_SSCR_HSW_MASK (((1ULL << 12) - 1) << LTDC_SSCR_HSW_SHIFT)


struct ltdc_sscr {
    uint32_t vsh:11;
    uint32_t reserved0:5;
    uint32_t hsw:12;
    };

typedef struct ltdc_sscr ltdc_sscr_t;
static_assert(sizeof(ltdc_sscr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC BPCR register
 *
 * LTDC back porch configuration register
 *
 *  @note offset: 0xcUL
 *        width:  32 bits
 */
#define LTDC_BPCR_REG  0xcUL

/**
 * @brief LTDC BPCR AVBP field
 *
 * accumulated Vertical back porch (in units of horizontal scan line) These bits define the accumulated vertical back porch width that includes the vertical synchronization and vertical back porch lines minus 1. The vertical back porch is the number of horizontal scan lines at a start of frame to the start of the first active scan line of the next frame.
 *
 * @note offset: 0x0UL
 *       width:  11
 *       access: read-write
 */
#define LTDC_BPCR_AVBP_SHIFT 0x0UL
#define LTDC_BPCR_AVBP_MASK (((1ULL << 11) - 1) << LTDC_BPCR_AVBP_SHIFT)
/**
 * @brief LTDC BPCR AHBP field
 *
 * accumulated horizontal back porch (in units of pixel clock period) These bits define the accumulated horizontal back porch width that includes the horizontal synchronization and horizontal back porch pixels minus 1. The horizontal back porch is the period between horizontal synchronization going inactive and the start of the active display part of the next scan line.
 *
 * @note offset: 0x10UL
 *       width:  12
 *       access: read-write
 */
#define LTDC_BPCR_AHBP_SHIFT 0x10UL
#define LTDC_BPCR_AHBP_MASK (((1ULL << 12) - 1) << LTDC_BPCR_AHBP_SHIFT)


struct ltdc_bpcr {
    uint32_t avbp:11;
    uint32_t reserved0:5;
    uint32_t ahbp:12;
    };

typedef struct ltdc_bpcr ltdc_bpcr_t;
static_assert(sizeof(ltdc_bpcr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC AWCR register
 *
 * LTDC active width configuration register
 *
 *  @note offset: 0x10UL
 *        width:  32 bits
 */
#define LTDC_AWCR_REG  0x10UL

/**
 * @brief LTDC AWCR AAH field
 *
 * accumulated active height (in units of horizontal scan line) These bits define the accumulated height which includes the vertical synchronization, vertical back porch and the active height lines minus 1. The active height is the number of active lines in the panel. Refer to device datasheet for maximum active height supported following maximum pixel clock.
 *
 * @note offset: 0x0UL
 *       width:  11
 *       access: read-write
 */
#define LTDC_AWCR_AAH_SHIFT 0x0UL
#define LTDC_AWCR_AAH_MASK (((1ULL << 11) - 1) << LTDC_AWCR_AAH_SHIFT)
/**
 * @brief LTDC AWCR AAW field
 *
 * accumulated active width (in units of pixel clock period) These bits define the accumulated active width which includes the horizontal synchronization, horizontal back porch and active pixels minus 1. The active width is the number of pixels in active display area of the panel scan line. Refer to device datasheet for maximum active width supported following maximum pixel clock.
 *
 * @note offset: 0x10UL
 *       width:  12
 *       access: read-write
 */
#define LTDC_AWCR_AAW_SHIFT 0x10UL
#define LTDC_AWCR_AAW_MASK (((1ULL << 12) - 1) << LTDC_AWCR_AAW_SHIFT)


struct ltdc_awcr {
    uint32_t aah:11;
    uint32_t reserved0:5;
    uint32_t aaw:12;
    };

typedef struct ltdc_awcr ltdc_awcr_t;
static_assert(sizeof(ltdc_awcr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC TWCR register
 *
 * LTDC total width configuration register
 *
 *  @note offset: 0x14UL
 *        width:  32 bits
 */
#define LTDC_TWCR_REG  0x14UL

/**
 * @brief LTDC TWCR TOTALH field
 *
 * total height (in units of horizontal scan line) These bits defines the accumulated height which includes the vertical synchronization, vertical back porch, the active height and vertical front porch height lines minus 1.
 *
 * @note offset: 0x0UL
 *       width:  11
 *       access: read-write
 */
#define LTDC_TWCR_TOTALH_SHIFT 0x0UL
#define LTDC_TWCR_TOTALH_MASK (((1ULL << 11) - 1) << LTDC_TWCR_TOTALH_SHIFT)
/**
 * @brief LTDC TWCR TOTALW field
 *
 * total width (in units of pixel clock period) These bits defines the accumulated total width which includes the horizontal synchronization, horizontal back porch, active width and horizontal front porch pixels minus 1.
 *
 * @note offset: 0x10UL
 *       width:  12
 *       access: read-write
 */
#define LTDC_TWCR_TOTALW_SHIFT 0x10UL
#define LTDC_TWCR_TOTALW_MASK (((1ULL << 12) - 1) << LTDC_TWCR_TOTALW_SHIFT)


