outpost-os/drv-stm32-ltdc/src/stm32_ltdc_defs.h
struct ltdc_twcr {
    uint32_t totalh:11;
    uint32_t reserved0:5;
    uint32_t totalw:12;
    };

typedef struct ltdc_twcr ltdc_twcr_t;
static_assert(sizeof(ltdc_twcr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC GCR register
 *
 * LTDC global control register
 *
 *  @note offset: 0x18UL
 *        width:  32 bits
 */
#define LTDC_GCR_REG  0x18UL

/**
 * @brief LTDC GCR LTDCEN field
 *
 * LCD-TFT controller enable This bit is set and cleared by software.
 *
 * @note offset: 0x0UL
 *       width:  1
 *       access: read-write
 */
#define LTDC_GCR_LTDCEN (1UL << 0x0UL)
#define LTDC_GCR_LTDCEN_SHIFT 0x0UL
#define LTDC_GCR_LTDCEN_MASK (((1ULL << 1) - 1) << LTDC_GCR_LTDCEN_SHIFT)
/**
 * @brief LTDC GCR DBW field
 *
 * dither blue width These bits return the dither blue bits.
 *
 * @note offset: 0x4UL
 *       width:  3
 *       access: read-only
 */
#define LTDC_GCR_DBW_SHIFT 0x4UL
#define LTDC_GCR_DBW_MASK (((1ULL << 3) - 1) << LTDC_GCR_DBW_SHIFT)
/**
 * @brief LTDC GCR DGW field
 *
 * dither green width These bits return the dither green bits.
 *
 * @note offset: 0x8UL
 *       width:  3
 *       access: read-only
 */
#define LTDC_GCR_DGW_SHIFT 0x8UL
#define LTDC_GCR_DGW_MASK (((1ULL << 3) - 1) << LTDC_GCR_DGW_SHIFT)
/**
 * @brief LTDC GCR DRW field
 *
 * dither red width These bits return the Dither Red Bits.
 *
 * @note offset: 0xcUL
 *       width:  3
 *       access: read-only
 */
#define LTDC_GCR_DRW_SHIFT 0xcUL
#define LTDC_GCR_DRW_MASK (((1ULL << 3) - 1) << LTDC_GCR_DRW_SHIFT)
/**
 * @brief LTDC GCR DEN field
 *
 * dither enable This bit is set and cleared by software.
 *
 * @note offset: 0x10UL
 *       width:  1
 *       access: read-write
 */
#define LTDC_GCR_DEN (1UL << 0x10UL)
#define LTDC_GCR_DEN_SHIFT 0x10UL
#define LTDC_GCR_DEN_MASK (((1ULL << 1) - 1) << LTDC_GCR_DEN_SHIFT)
/**
 * @brief LTDC GCR PCPOL field
 *
 * pixel clock polarity This bit is set and cleared by software.
 *
 * @note offset: 0x1cUL
 *       width:  1
 *       access: read-write
 */
#define LTDC_GCR_PCPOL (1UL << 0x1cUL)
#define LTDC_GCR_PCPOL_SHIFT 0x1cUL
#define LTDC_GCR_PCPOL_MASK (((1ULL << 1) - 1) << LTDC_GCR_PCPOL_SHIFT)
/**
 * @brief LTDC GCR DEPOL field
 *
 * not data enable polarity This bit is set and cleared by software.
 *
 * @note offset: 0x1dUL
 *       width:  1
 *       access: read-write
 */
#define LTDC_GCR_DEPOL (1UL << 0x1dUL)
#define LTDC_GCR_DEPOL_SHIFT 0x1dUL
#define LTDC_GCR_DEPOL_MASK (((1ULL << 1) - 1) << LTDC_GCR_DEPOL_SHIFT)
/**
 * @brief LTDC GCR VSPOL field
 *
 * vertical synchronization polarity This bit is set and cleared by software.
 *
 * @note offset: 0x1eUL
 *       width:  1
 *       access: read-write
 */
#define LTDC_GCR_VSPOL (1UL << 0x1eUL)
#define LTDC_GCR_VSPOL_SHIFT 0x1eUL
#define LTDC_GCR_VSPOL_MASK (((1ULL << 1) - 1) << LTDC_GCR_VSPOL_SHIFT)
/**
 * @brief LTDC GCR HSPOL field
 *
 * horizontal synchronization polarity This bit is set and cleared by software.
 *
 * @note offset: 0x1fUL
 *       width:  1
 *       access: read-write
 */
#define LTDC_GCR_HSPOL (1UL << 0x1fUL)
#define LTDC_GCR_HSPOL_SHIFT 0x1fUL
#define LTDC_GCR_HSPOL_MASK (((1ULL << 1) - 1) << LTDC_GCR_HSPOL_SHIFT)


struct ltdc_gcr {
    uint32_t ltdcen:1;
    uint32_t reserved0:3;
    uint32_t dbw:3;
    uint32_t reserved1:1;
    uint32_t dgw:3;
    uint32_t reserved2:1;
    uint32_t drw:3;
    uint32_t reserved3:1;
    uint32_t den:1;
    uint32_t reserved4:11;
    uint32_t pcpol:1;
    uint32_t depol:1;
    uint32_t vspol:1;
    uint32_t hspol:1;
    };

typedef struct ltdc_gcr ltdc_gcr_t;
static_assert(sizeof(ltdc_gcr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC SRCR register
 *
 * LTDC shadow reload configuration register
 *
 *  @note offset: 0x24UL
 *        width:  32 bits
 */
#define LTDC_SRCR_REG  0x24UL

/**
 * @brief LTDC SRCR IMR field
 *
 * immediate reload This bit is set by software and cleared only by hardware after reload.
 *
 * @note offset: 0x0UL
 *       width:  1
 *       access: read-write
 */
#define LTDC_SRCR_IMR (1UL << 0x0UL)
#define LTDC_SRCR_IMR_SHIFT 0x0UL
#define LTDC_SRCR_IMR_MASK (((1ULL << 1) - 1) << LTDC_SRCR_IMR_SHIFT)
/**
 * @brief LTDC SRCR VBR field
 *
 * vertical blanking reload This bit is set by software and cleared only by hardware after reload (it cannot be cleared through register write once it is set).
 *
 * @note offset: 0x1UL
 *       width:  1
 *       access: read-write
 */
#define LTDC_SRCR_VBR (1UL << 0x1UL)
#define LTDC_SRCR_VBR_SHIFT 0x1UL
#define LTDC_SRCR_VBR_MASK (((1ULL << 1) - 1) << LTDC_SRCR_VBR_SHIFT)


struct ltdc_srcr {
    uint32_t imr:1;
    uint32_t vbr:1;
    };

typedef struct ltdc_srcr ltdc_srcr_t;
static_assert(sizeof(ltdc_srcr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC BCCR register
 *
 * LTDC background color configuration register
 *
 *  @note offset: 0x2cUL
 *        width:  32 bits
 */
#define LTDC_BCCR_REG  0x2cUL

/**
 * @brief LTDC BCCR BCBLUE field
 *
 * background color blue value These bits configure the background blue value.
 *
 * @note offset: 0x0UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_BCCR_BCBLUE_SHIFT 0x0UL
#define LTDC_BCCR_BCBLUE_MASK (((1ULL << 8) - 1) << LTDC_BCCR_BCBLUE_SHIFT)
/**
 * @brief LTDC BCCR BCGREEN field
 *
 * background color green value These bits configure the background green value.
 *
 * @note offset: 0x8UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_BCCR_BCGREEN_SHIFT 0x8UL
#define LTDC_BCCR_BCGREEN_MASK (((1ULL << 8) - 1) << LTDC_BCCR_BCGREEN_SHIFT)
/**
 * @brief LTDC BCCR BCRED field
 *
 * background color red value These bits configure the background red value.
 *
 * @note offset: 0x10UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_BCCR_BCRED_SHIFT 0x10UL
#define LTDC_BCCR_BCRED_MASK (((1ULL << 8) - 1) << LTDC_BCCR_BCRED_SHIFT)


struct ltdc_bccr {
    uint32_t bcblue:8;
    uint32_t bcgreen:8;
    uint32_t bcred:8;
    };

typedef struct ltdc_bccr ltdc_bccr_t;
static_assert(sizeof(ltdc_bccr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC IER register
 *
 * LTDC interrupt enable register
 *
 *  @note offset: 0x34UL
 *        width:  32 bits
 */
#define LTDC_IER_REG  0x34UL

/**
 * @brief LTDC IER LIE field
 *
 * line interrupt enable This bit is set and cleared by software.
 *
 * @note offset: 0x0UL
 *       width:  1
 *       access: read-write
 */
#define LTDC_IER_LIE (1UL << 0x0UL)
#define LTDC_IER_LIE_SHIFT 0x0UL
#define LTDC_IER_LIE_MASK (((1ULL << 1) - 1) << LTDC_IER_LIE_SHIFT)
/**
 * @brief LTDC IER FUIE field
 *
 * FIFO underrun interrupt enable This bit is set and cleared by software.
 *
 * @note offset: 0x1UL
 *       width:  1
 *       access: read-write
 */
#define LTDC_IER_FUIE (1UL << 0x1UL)
#define LTDC_IER_FUIE_SHIFT 0x1UL
#define LTDC_IER_FUIE_MASK (((1ULL << 1) - 1) << LTDC_IER_FUIE_SHIFT)
/**
 * @brief LTDC IER TERRIE field
 *
 * transfer error interrupt enable This bit is set and cleared by software.
 *
 * @note offset: 0x2UL
 *       width:  1
 *       access: read-write
 */
#define LTDC_IER_TERRIE (1UL << 0x2UL)
#define LTDC_IER_TERRIE_SHIFT 0x2UL
#define LTDC_IER_TERRIE_MASK (((1ULL << 1) - 1) << LTDC_IER_TERRIE_SHIFT)
/**
 * @brief LTDC IER RRIE field
 *
 * register reload interrupt enable This bit is set and cleared by software.
 *
 * @note offset: 0x3UL
 *       width:  1
 *       access: read-write
 */
#define LTDC_IER_RRIE (1UL << 0x3UL)
#define LTDC_IER_RRIE_SHIFT 0x3UL
#define LTDC_IER_RRIE_MASK (((1ULL << 1) - 1) << LTDC_IER_RRIE_SHIFT)


