outpost-os/drv-stm32-ltdc/src/stm32_ltdc_defs.h
struct ltdc_ier {
    uint32_t lie:1;
    uint32_t fuie:1;
    uint32_t terrie:1;
    uint32_t rrie:1;
    };

typedef struct ltdc_ier ltdc_ier_t;
static_assert(sizeof(ltdc_ier_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC ISR register
 *
 * LTDC interrupt status register
 *
 *  @note offset: 0x38UL
 *        width:  32 bits
 */
#define LTDC_ISR_REG  0x38UL

/**
 * @brief LTDC ISR LIF field
 *
 * line interrupt flag
 *
 * @note offset: 0x0UL
 *       width:  1
 *       access: read-only
 */
#define LTDC_ISR_LIF (1UL << 0x0UL)
#define LTDC_ISR_LIF_SHIFT 0x0UL
#define LTDC_ISR_LIF_MASK (((1ULL << 1) - 1) << LTDC_ISR_LIF_SHIFT)
/**
 * @brief LTDC ISR FUIF field
 *
 * FIFO underrun interrupt flag
 *
 * @note offset: 0x1UL
 *       width:  1
 *       access: read-only
 */
#define LTDC_ISR_FUIF (1UL << 0x1UL)
#define LTDC_ISR_FUIF_SHIFT 0x1UL
#define LTDC_ISR_FUIF_MASK (((1ULL << 1) - 1) << LTDC_ISR_FUIF_SHIFT)
/**
 * @brief LTDC ISR TERRIF field
 *
 * transfer error interrupt flag
 *
 * @note offset: 0x2UL
 *       width:  1
 *       access: read-only
 */
#define LTDC_ISR_TERRIF (1UL << 0x2UL)
#define LTDC_ISR_TERRIF_SHIFT 0x2UL
#define LTDC_ISR_TERRIF_MASK (((1ULL << 1) - 1) << LTDC_ISR_TERRIF_SHIFT)
/**
 * @brief LTDC ISR RRIF field
 *
 * register reload interrupt flag
 *
 * @note offset: 0x3UL
 *       width:  1
 *       access: read-only
 */
#define LTDC_ISR_RRIF (1UL << 0x3UL)
#define LTDC_ISR_RRIF_SHIFT 0x3UL
#define LTDC_ISR_RRIF_MASK (((1ULL << 1) - 1) << LTDC_ISR_RRIF_SHIFT)


struct ltdc_isr {
    uint32_t lif:1;
    uint32_t fuif:1;
    uint32_t terrif:1;
    uint32_t rrif:1;
    };

typedef struct ltdc_isr ltdc_isr_t;
static_assert(sizeof(ltdc_isr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC ICR register
 *  @note offset: 0x3cUL
 *        width:  32 bits
 */
#define LTDC_ICR_REG  0x3cUL

/**
 * @brief LTDC ICR CLIF field
 *
 * clears the line interrupt flag
 *
 * @note offset: 0x0UL
 *       width:  1
 *       access: write-only
 */
#define LTDC_ICR_CLIF (1UL << 0x0UL)
#define LTDC_ICR_CLIF_SHIFT 0x0UL
#define LTDC_ICR_CLIF_MASK (((1ULL << 1) - 1) << LTDC_ICR_CLIF_SHIFT)
/**
 * @brief LTDC ICR CFUIF field
 *
 * clears the FIFO underrun interrupt flag
 *
 * @note offset: 0x1UL
 *       width:  1
 *       access: write-only
 */
#define LTDC_ICR_CFUIF (1UL << 0x1UL)
#define LTDC_ICR_CFUIF_SHIFT 0x1UL
#define LTDC_ICR_CFUIF_MASK (((1ULL << 1) - 1) << LTDC_ICR_CFUIF_SHIFT)
/**
 * @brief LTDC ICR CTERRIF field
 *
 * clears the transfer error interrupt flag
 *
 * @note offset: 0x2UL
 *       width:  1
 *       access: write-only
 */
#define LTDC_ICR_CTERRIF (1UL << 0x2UL)
#define LTDC_ICR_CTERRIF_SHIFT 0x2UL
#define LTDC_ICR_CTERRIF_MASK (((1ULL << 1) - 1) << LTDC_ICR_CTERRIF_SHIFT)
/**
 * @brief LTDC ICR CRRIF field
 *
 * clears register reload interrupt flag
 *
 * @note offset: 0x3UL
 *       width:  1
 *       access: write-only
 */
#define LTDC_ICR_CRRIF (1UL << 0x3UL)
#define LTDC_ICR_CRRIF_SHIFT 0x3UL
#define LTDC_ICR_CRRIF_MASK (((1ULL << 1) - 1) << LTDC_ICR_CRRIF_SHIFT)


struct ltdc_icr {
    uint32_t clif:1;
    uint32_t cfuif:1;
    uint32_t cterrif:1;
    uint32_t crrif:1;
    };

typedef struct ltdc_icr ltdc_icr_t;
static_assert(sizeof(ltdc_icr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC LIPCR register
 *
 * LTDC line interrupt position configuration register
 *
 *  @note offset: 0x40UL
 *        width:  32 bits
 */
#define LTDC_LIPCR_REG  0x40UL

/**
 * @brief LTDC LIPCR LIPOS field
 *
 * line interrupt position These bits configure the line interrupt position.
 *
 * @note offset: 0x0UL
 *       width:  11
 *       access: read-write
 */
#define LTDC_LIPCR_LIPOS_SHIFT 0x0UL
#define LTDC_LIPCR_LIPOS_MASK (((1ULL << 11) - 1) << LTDC_LIPCR_LIPOS_SHIFT)


struct ltdc_lipcr {
    uint32_t lipos:11;
    };

typedef struct ltdc_lipcr ltdc_lipcr_t;
static_assert(sizeof(ltdc_lipcr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC CPSR register
 *  @note offset: 0x44UL
 *        width:  32 bits
 */
#define LTDC_CPSR_REG  0x44UL

/**
 * @brief LTDC CPSR CYPOS field
 *
 * current Y position These bits return the current Y position.
 *
 * @note offset: 0x0UL
 *       width:  16
 *       access: read-only
 */
#define LTDC_CPSR_CYPOS_SHIFT 0x0UL
#define LTDC_CPSR_CYPOS_MASK (((1ULL << 16) - 1) << LTDC_CPSR_CYPOS_SHIFT)
/**
 * @brief LTDC CPSR CXPOS field
 *
 * current X position These bits return the current X position.
 *
 * @note offset: 0x10UL
 *       width:  16
 *       access: read-only
 */
#define LTDC_CPSR_CXPOS_SHIFT 0x10UL
#define LTDC_CPSR_CXPOS_MASK (((1ULL << 16) - 1) << LTDC_CPSR_CXPOS_SHIFT)


struct ltdc_cpsr {
    uint32_t cypos:16;
    uint32_t cxpos:16;
    };

typedef struct ltdc_cpsr ltdc_cpsr_t;
static_assert(sizeof(ltdc_cpsr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC CDSR register
 *
 * LTDC current display status register
 *
 *  @note offset: 0x48UL
 *        width:  32 bits
 */
#define LTDC_CDSR_REG  0x48UL

/**
 * @brief LTDC CDSR VDES field
 *
 * vertical data enable display status
 *
 * @note offset: 0x0UL
 *       width:  1
 *       access: read-only
 */
#define LTDC_CDSR_VDES (1UL << 0x0UL)
#define LTDC_CDSR_VDES_SHIFT 0x0UL
#define LTDC_CDSR_VDES_MASK (((1ULL << 1) - 1) << LTDC_CDSR_VDES_SHIFT)
/**
 * @brief LTDC CDSR HDES field
 *
 * horizontal data enable display status
 *
 * @note offset: 0x1UL
 *       width:  1
 *       access: read-only
 */
#define LTDC_CDSR_HDES (1UL << 0x1UL)
#define LTDC_CDSR_HDES_SHIFT 0x1UL
#define LTDC_CDSR_HDES_MASK (((1ULL << 1) - 1) << LTDC_CDSR_HDES_SHIFT)
/**
 * @brief LTDC CDSR VSYNCS field
 *
 * vertical synchronization display status
 *
 * @note offset: 0x2UL
 *       width:  1
 *       access: read-only
 */
#define LTDC_CDSR_VSYNCS (1UL << 0x2UL)
#define LTDC_CDSR_VSYNCS_SHIFT 0x2UL
#define LTDC_CDSR_VSYNCS_MASK (((1ULL << 1) - 1) << LTDC_CDSR_VSYNCS_SHIFT)
/**
 * @brief LTDC CDSR HSYNCS field
 *
 * horizontal synchronization display status
 *
 * @note offset: 0x3UL
 *       width:  1
 *       access: read-only
 */
#define LTDC_CDSR_HSYNCS (1UL << 0x3UL)
#define LTDC_CDSR_HSYNCS_SHIFT 0x3UL
#define LTDC_CDSR_HSYNCS_MASK (((1ULL << 1) - 1) << LTDC_CDSR_HSYNCS_SHIFT)


struct ltdc_cdsr {
    uint32_t vdes:1;
    uint32_t hdes:1;
    uint32_t vsyncs:1;
    uint32_t hsyncs:1;
    };

typedef struct ltdc_cdsr ltdc_cdsr_t;
static_assert(sizeof(ltdc_cdsr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L1CR register
 *  @note offset: 0x84UL
 *        width:  32 bits
 */
#define LTDC_L1CR_REG  0x84UL

/**
 * @brief LTDC L1CR LEN field
 *
 * layer enable This bit is set and cleared by software.
 *
 * @note offset: 0x0UL
 *       width:  1
 *       access: read-write
 */
#define LTDC_L1CR_LEN (1UL << 0x0UL)
#define LTDC_L1CR_LEN_SHIFT 0x0UL
#define LTDC_L1CR_LEN_MASK (((1ULL << 1) - 1) << LTDC_L1CR_LEN_SHIFT)
/**
 * @brief LTDC L1CR COLKEN field
 *
 * color keying enable This bit is set and cleared by software.
 *
 * @note offset: 0x1UL
 *       width:  1
 *       access: read-write
 */
#define LTDC_L1CR_COLKEN (1UL << 0x1UL)
#define LTDC_L1CR_COLKEN_SHIFT 0x1UL
#define LTDC_L1CR_COLKEN_MASK (((1ULL << 1) - 1) << LTDC_L1CR_COLKEN_SHIFT)
/**
 * @brief LTDC L1CR CLUTEN field
 *
 * color look-up table enable This bit is set and cleared by software. The CLUT is only meaningful for L8, AL44 and AL88 pixel format. Refer to table (CLUT)
 *
 * @note offset: 0x4UL
 *       width:  1
 *       access: read-write
 */
#define LTDC_L1CR_CLUTEN (1UL << 0x4UL)
#define LTDC_L1CR_CLUTEN_SHIFT 0x4UL
#define LTDC_L1CR_CLUTEN_MASK (((1ULL << 1) - 1) << LTDC_L1CR_CLUTEN_SHIFT)


struct ltdc_l1cr {
    uint32_t len:1;
    uint32_t colken:1;
    uint32_t reserved0:2;
    uint32_t cluten:1;
    };

