outpost-os/drv-stm32-ltdc/src/stm32_ltdc_defs.h
typedef struct ltdc_l1cr ltdc_l1cr_t;
static_assert(sizeof(ltdc_l1cr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L1WHPCR register
 *
 * LTDC layer 1 window horizontal position configuration register
 *
 *  @note offset: 0x88UL
 *        width:  32 bits
 */
#define LTDC_L1WHPCR_REG  0x88UL

/**
 * @brief LTDC L1WHPCR WHSTPOS field
 *
 * window horizontal start position These bits configure the first visible pixel of a line of the layer window. WHSTPOS[11:0] must be ≤ AAW[11:0] bits (programmed in LTDC_AWCR register).
 *
 * @note offset: 0x0UL
 *       width:  12
 *       access: read-write
 */
#define LTDC_L1WHPCR_WHSTPOS_SHIFT 0x0UL
#define LTDC_L1WHPCR_WHSTPOS_MASK (((1ULL << 12) - 1) << LTDC_L1WHPCR_WHSTPOS_SHIFT)
/**
 * @brief LTDC L1WHPCR WHSPPOS field
 *
 * window horizontal stop position These bits configure the last visible pixel of a line of the layer window. WHSPPOS[11:0] must be ≥ AHBP[11:0] bits + 1 (programmed in LTDC_BPCR register).
 *
 * @note offset: 0x10UL
 *       width:  12
 *       access: read-write
 */
#define LTDC_L1WHPCR_WHSPPOS_SHIFT 0x10UL
#define LTDC_L1WHPCR_WHSPPOS_MASK (((1ULL << 12) - 1) << LTDC_L1WHPCR_WHSPPOS_SHIFT)


struct ltdc_l1whpcr {
    uint32_t whstpos:12;
    uint32_t reserved0:4;
    uint32_t whsppos:12;
    };

typedef struct ltdc_l1whpcr ltdc_l1whpcr_t;
static_assert(sizeof(ltdc_l1whpcr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L1WVPCR register
 *
 * LTDC layer 1 window vertical position configuration register
 *
 *  @note offset: 0x8cUL
 *        width:  32 bits
 */
#define LTDC_L1WVPCR_REG  0x8cUL

/**
 * @brief LTDC L1WVPCR WVSTPOS field
 *
 * window vertical start position These bits configure the first visible line of the layer window. WVSTPOS[10:0] must be ≤ AAH[10:0] bits (programmed in LTDC_AWCR register).
 *
 * @note offset: 0x0UL
 *       width:  11
 *       access: read-write
 */
#define LTDC_L1WVPCR_WVSTPOS_SHIFT 0x0UL
#define LTDC_L1WVPCR_WVSTPOS_MASK (((1ULL << 11) - 1) << LTDC_L1WVPCR_WVSTPOS_SHIFT)
/**
 * @brief LTDC L1WVPCR WVSPPOS field
 *
 * window vertical stop position These bits configure the last visible line of the layer window. WVSPPOS[10:0] must be ≥ AVBP[10:0] bits + 1 (programmed in LTDC_BPCR register).
 *
 * @note offset: 0x10UL
 *       width:  11
 *       access: read-write
 */
#define LTDC_L1WVPCR_WVSPPOS_SHIFT 0x10UL
#define LTDC_L1WVPCR_WVSPPOS_MASK (((1ULL << 11) - 1) << LTDC_L1WVPCR_WVSPPOS_SHIFT)


struct ltdc_l1wvpcr {
    uint32_t wvstpos:11;
    uint32_t reserved0:5;
    uint32_t wvsppos:11;
    };

typedef struct ltdc_l1wvpcr ltdc_l1wvpcr_t;
static_assert(sizeof(ltdc_l1wvpcr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L1CKCR register
 *
 * LTDC layer 1 color keying configuration register
 *
 *  @note offset: 0x90UL
 *        width:  32 bits
 */
#define LTDC_L1CKCR_REG  0x90UL

/**
 * @brief LTDC L1CKCR CKBLUE field
 *
 * color key blue value
 *
 * @note offset: 0x0UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_L1CKCR_CKBLUE_SHIFT 0x0UL
#define LTDC_L1CKCR_CKBLUE_MASK (((1ULL << 8) - 1) << LTDC_L1CKCR_CKBLUE_SHIFT)
/**
 * @brief LTDC L1CKCR CKGREEN field
 *
 * color key green value
 *
 * @note offset: 0x8UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_L1CKCR_CKGREEN_SHIFT 0x8UL
#define LTDC_L1CKCR_CKGREEN_MASK (((1ULL << 8) - 1) << LTDC_L1CKCR_CKGREEN_SHIFT)
/**
 * @brief LTDC L1CKCR CKRED field
 *
 * color key red value
 *
 * @note offset: 0x10UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_L1CKCR_CKRED_SHIFT 0x10UL
#define LTDC_L1CKCR_CKRED_MASK (((1ULL << 8) - 1) << LTDC_L1CKCR_CKRED_SHIFT)


struct ltdc_l1ckcr {
    uint32_t ckblue:8;
    uint32_t ckgreen:8;
    uint32_t ckred:8;
    };

typedef struct ltdc_l1ckcr ltdc_l1ckcr_t;
static_assert(sizeof(ltdc_l1ckcr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L1PFCR register
 *
 * LTDC layer 1 pixel format configuration register
 *
 *  @note offset: 0x94UL
 *        width:  32 bits
 */
#define LTDC_L1PFCR_REG  0x94UL

/**
 * @brief LTDC L1PFCR PF field
 *
 * pixel format These bits configure the pixel format
 *
 * @note offset: 0x0UL
 *       width:  3
 *       access: read-write
 */
#define LTDC_L1PFCR_PF_SHIFT 0x0UL
#define LTDC_L1PFCR_PF_MASK (((1ULL << 3) - 1) << LTDC_L1PFCR_PF_SHIFT)


struct ltdc_l1pfcr {
    uint32_t pf:3;
    };

typedef struct ltdc_l1pfcr ltdc_l1pfcr_t;
static_assert(sizeof(ltdc_l1pfcr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L1CACR register
 *
 * LTDC layer 1 constant alpha configuration register
 *
 *  @note offset: 0x98UL
 *        width:  32 bits
 */
#define LTDC_L1CACR_REG  0x98UL

/**
 * @brief LTDC L1CACR CONSTA field
 *
 * constant alpha These bits configure the constant alpha used for blending. The constant alpha is divided by 255 by hardware. Example: if the programmed constant alpha is 0xFF, the constant alpha value is 255 / 255 = 1.
 *
 * @note offset: 0x0UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_L1CACR_CONSTA_SHIFT 0x0UL
#define LTDC_L1CACR_CONSTA_MASK (((1ULL << 8) - 1) << LTDC_L1CACR_CONSTA_SHIFT)


struct ltdc_l1cacr {
    uint32_t consta:8;
    };

typedef struct ltdc_l1cacr ltdc_l1cacr_t;
static_assert(sizeof(ltdc_l1cacr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L1DCCR register
 *
 * LTDC layer 1 default color configuration register
 *
 *  @note offset: 0x9cUL
 *        width:  32 bits
 */
#define LTDC_L1DCCR_REG  0x9cUL

/**
 * @brief LTDC L1DCCR DCBLUE field
 *
 * default color blue These bits configure the default blue value.
 *
 * @note offset: 0x0UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_L1DCCR_DCBLUE_SHIFT 0x0UL
#define LTDC_L1DCCR_DCBLUE_MASK (((1ULL << 8) - 1) << LTDC_L1DCCR_DCBLUE_SHIFT)
/**
 * @brief LTDC L1DCCR DCGREEN field
 *
 * default color green These bits configure the default green value.
 *
 * @note offset: 0x8UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_L1DCCR_DCGREEN_SHIFT 0x8UL
#define LTDC_L1DCCR_DCGREEN_MASK (((1ULL << 8) - 1) << LTDC_L1DCCR_DCGREEN_SHIFT)
/**
 * @brief LTDC L1DCCR DCRED field
 *
 * default color red These bits configure the default red value.
 *
 * @note offset: 0x10UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_L1DCCR_DCRED_SHIFT 0x10UL
#define LTDC_L1DCCR_DCRED_MASK (((1ULL << 8) - 1) << LTDC_L1DCCR_DCRED_SHIFT)
/**
 * @brief LTDC L1DCCR DCALPHA field
 *
 * default color alpha These bits configure the default alpha value.
 *
 * @note offset: 0x18UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_L1DCCR_DCALPHA_SHIFT 0x18UL
#define LTDC_L1DCCR_DCALPHA_MASK (((1ULL << 8) - 1) << LTDC_L1DCCR_DCALPHA_SHIFT)


struct ltdc_l1dccr {
    uint32_t dcblue:8;
    uint32_t dcgreen:8;
    uint32_t dcred:8;
    uint32_t dcalpha:8;
    };

typedef struct ltdc_l1dccr ltdc_l1dccr_t;
static_assert(sizeof(ltdc_l1dccr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L1BFCR register
 *
 * LTDC layer 1 blending factors configuration register
 *
 *  @note offset: 0xa0UL
 *        width:  32 bits
 */
#define LTDC_L1BFCR_REG  0xa0UL

/**
 * @brief LTDC L1BFCR BF2 field
 *
 * blending factor 2 These bits select the blending factor F2
 *
 * @note offset: 0x0UL
 *       width:  3
 *       access: read-write
 */
#define LTDC_L1BFCR_BF2_SHIFT 0x0UL
#define LTDC_L1BFCR_BF2_MASK (((1ULL << 3) - 1) << LTDC_L1BFCR_BF2_SHIFT)
/**
 * @brief LTDC L1BFCR BF1 field
 *
 * blending factor 1 These bits select the blending factor F1.
 *
 * @note offset: 0x8UL
 *       width:  3
 *       access: read-write
 */
#define LTDC_L1BFCR_BF1_SHIFT 0x8UL
#define LTDC_L1BFCR_BF1_MASK (((1ULL << 3) - 1) << LTDC_L1BFCR_BF1_SHIFT)


struct ltdc_l1bfcr {
    uint32_t bf2:3;
    uint32_t reserved0:5;
    uint32_t bf1:3;
    };

