outpost-os/drv-stm32-ltdc/src/stm32_ltdc_defs.h
typedef struct ltdc_l1bfcr ltdc_l1bfcr_t;
static_assert(sizeof(ltdc_l1bfcr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L1CFBAR register
 *
 * LTDC layer 1 color frame buffer address register
 *
 *  @note offset: 0xacUL
 *        width:  32 bits
 */
#define LTDC_L1CFBAR_REG  0xacUL

/**
 * @brief LTDC L1CFBAR CFBADD field
 *
 * color frame buffer start address These bits define the color frame buffer start address.
 *
 * @note offset: 0x0UL
 *       width:  32
 *       access: read-write
 */
#define LTDC_L1CFBAR_CFBADD_SHIFT 0x0UL
#define LTDC_L1CFBAR_CFBADD_MASK (((1ULL << 32) - 1) << LTDC_L1CFBAR_CFBADD_SHIFT)


struct ltdc_l1cfbar {
    uint32_t cfbadd:32;
    };

typedef struct ltdc_l1cfbar ltdc_l1cfbar_t;
static_assert(sizeof(ltdc_l1cfbar_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L1CFBLR register
 *
 * LTDC layer 1 color frame buffer length register
 *
 *  @note offset: 0xb0UL
 *        width:  32 bits
 */
#define LTDC_L1CFBLR_REG  0xb0UL

/**
 * @brief LTDC L1CFBLR CFBLL field
 *
 * color frame buffer line length These bits define the length of one line of pixels in bytes + 3. The line length is computed as follows: active high width * number of bytes per pixel + 3.
 *
 * @note offset: 0x0UL
 *       width:  13
 *       access: read-write
 */
#define LTDC_L1CFBLR_CFBLL_SHIFT 0x0UL
#define LTDC_L1CFBLR_CFBLL_MASK (((1ULL << 13) - 1) << LTDC_L1CFBLR_CFBLL_SHIFT)
/**
 * @brief LTDC L1CFBLR CFBP field
 *
 * color frame buffer pitch in bytes These bits define the pitch that is the increment from the start of one line of pixels to the start of the next line in bytes.
 *
 * @note offset: 0x10UL
 *       width:  13
 *       access: read-write
 */
#define LTDC_L1CFBLR_CFBP_SHIFT 0x10UL
#define LTDC_L1CFBLR_CFBP_MASK (((1ULL << 13) - 1) << LTDC_L1CFBLR_CFBP_SHIFT)


struct ltdc_l1cfblr {
    uint32_t cfbll:13;
    uint32_t reserved0:3;
    uint32_t cfbp:13;
    };

typedef struct ltdc_l1cfblr ltdc_l1cfblr_t;
static_assert(sizeof(ltdc_l1cfblr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L1CFBLNR register
 *
 * LTDC layer 1 color frame buffer line number register
 *
 *  @note offset: 0xb4UL
 *        width:  32 bits
 */
#define LTDC_L1CFBLNR_REG  0xb4UL

/**
 * @brief LTDC L1CFBLNR CFBLNBR field
 *
 * frame buffer line number These bits define the number of lines in the frame buffer that corresponds to the active high width.
 *
 * @note offset: 0x0UL
 *       width:  11
 *       access: read-write
 */
#define LTDC_L1CFBLNR_CFBLNBR_SHIFT 0x0UL
#define LTDC_L1CFBLNR_CFBLNBR_MASK (((1ULL << 11) - 1) << LTDC_L1CFBLNR_CFBLNBR_SHIFT)


struct ltdc_l1cfblnr {
    uint32_t cfblnbr:11;
    };

typedef struct ltdc_l1cfblnr ltdc_l1cfblnr_t;
static_assert(sizeof(ltdc_l1cfblnr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L1CLUTWR register
 *
 * LTDC layer 1 CLUT write register
 *
 *  @note offset: 0xc4UL
 *        width:  32 bits
 */
#define LTDC_L1CLUTWR_REG  0xc4UL

/**
 * @brief LTDC L1CLUTWR BLUE field
 *
 * blue value These bits configure the blue value.
 *
 * @note offset: 0x0UL
 *       width:  8
 *       access: write-only
 */
#define LTDC_L1CLUTWR_BLUE_SHIFT 0x0UL
#define LTDC_L1CLUTWR_BLUE_MASK (((1ULL << 8) - 1) << LTDC_L1CLUTWR_BLUE_SHIFT)
/**
 * @brief LTDC L1CLUTWR GREEN field
 *
 * green value These bits configure the green value.
 *
 * @note offset: 0x8UL
 *       width:  8
 *       access: write-only
 */
#define LTDC_L1CLUTWR_GREEN_SHIFT 0x8UL
#define LTDC_L1CLUTWR_GREEN_MASK (((1ULL << 8) - 1) << LTDC_L1CLUTWR_GREEN_SHIFT)
/**
 * @brief LTDC L1CLUTWR RED field
 *
 * red value These bits configure the red value.
 *
 * @note offset: 0x10UL
 *       width:  8
 *       access: write-only
 */
#define LTDC_L1CLUTWR_RED_SHIFT 0x10UL
#define LTDC_L1CLUTWR_RED_MASK (((1ULL << 8) - 1) << LTDC_L1CLUTWR_RED_SHIFT)
/**
 * @brief LTDC L1CLUTWR CLUTADD field
 *
 * CLUT address These bits configure the CLUT address (color position within the CLUT) of each RGB value.
 *
 * @note offset: 0x18UL
 *       width:  8
 *       access: write-only
 */
#define LTDC_L1CLUTWR_CLUTADD_SHIFT 0x18UL
#define LTDC_L1CLUTWR_CLUTADD_MASK (((1ULL << 8) - 1) << LTDC_L1CLUTWR_CLUTADD_SHIFT)


struct ltdc_l1clutwr {
    uint32_t blue:8;
    uint32_t green:8;
    uint32_t red:8;
    uint32_t clutadd:8;
    };

typedef struct ltdc_l1clutwr ltdc_l1clutwr_t;
static_assert(sizeof(ltdc_l1clutwr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L2CR register
 *  @note offset: 0x104UL
 *        width:  32 bits
 */
#define LTDC_L2CR_REG  0x104UL

/**
 * @brief LTDC L2CR LEN field
 *
 * layer enable This bit is set and cleared by software.
 *
 * @note offset: 0x0UL
 *       width:  1
 *       access: read-write
 */
#define LTDC_L2CR_LEN (1UL << 0x0UL)
#define LTDC_L2CR_LEN_SHIFT 0x0UL
#define LTDC_L2CR_LEN_MASK (((1ULL << 1) - 1) << LTDC_L2CR_LEN_SHIFT)
/**
 * @brief LTDC L2CR COLKEN field
 *
 * color keying enable This bit is set and cleared by software.
 *
 * @note offset: 0x1UL
 *       width:  1
 *       access: read-write
 */
#define LTDC_L2CR_COLKEN (1UL << 0x1UL)
#define LTDC_L2CR_COLKEN_SHIFT 0x1UL
#define LTDC_L2CR_COLKEN_MASK (((1ULL << 1) - 1) << LTDC_L2CR_COLKEN_SHIFT)
/**
 * @brief LTDC L2CR CLUTEN field
 *
 * color look-up table enable This bit is set and cleared by software. The CLUT is only meaningful for L8, AL44 and AL88 pixel format. Refer to table (CLUT)
 *
 * @note offset: 0x4UL
 *       width:  1
 *       access: read-write
 */
#define LTDC_L2CR_CLUTEN (1UL << 0x4UL)
#define LTDC_L2CR_CLUTEN_SHIFT 0x4UL
#define LTDC_L2CR_CLUTEN_MASK (((1ULL << 1) - 1) << LTDC_L2CR_CLUTEN_SHIFT)


struct ltdc_l2cr {
    uint32_t len:1;
    uint32_t colken:1;
    uint32_t reserved0:2;
    uint32_t cluten:1;
    };

typedef struct ltdc_l2cr ltdc_l2cr_t;
static_assert(sizeof(ltdc_l2cr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L2WHPCR register
 *
 * LTDC layer 2 window horizontal position configuration register
 *
 *  @note offset: 0x108UL
 *        width:  32 bits
 */
#define LTDC_L2WHPCR_REG  0x108UL

/**
 * @brief LTDC L2WHPCR WHSTPOS field
 *
 * window horizontal start position These bits configure the first visible pixel of a line of the layer window. WHSTPOS[11:0] must be ≤ AAW[11:0] bits (programmed in LTDC_AWCR register).
 *
 * @note offset: 0x0UL
 *       width:  12
 *       access: read-write
 */
#define LTDC_L2WHPCR_WHSTPOS_SHIFT 0x0UL
#define LTDC_L2WHPCR_WHSTPOS_MASK (((1ULL << 12) - 1) << LTDC_L2WHPCR_WHSTPOS_SHIFT)
/**
 * @brief LTDC L2WHPCR WHSPPOS field
 *
 * window horizontal stop position These bits configure the last visible pixel of a line of the layer window. WHSPPOS[11:0] must be ≥ AHBP[11:0] bits + 1 (programmed in LTDC_BPCR register).
 *
 * @note offset: 0x10UL
 *       width:  12
 *       access: read-write
 */
#define LTDC_L2WHPCR_WHSPPOS_SHIFT 0x10UL
#define LTDC_L2WHPCR_WHSPPOS_MASK (((1ULL << 12) - 1) << LTDC_L2WHPCR_WHSPPOS_SHIFT)


struct ltdc_l2whpcr {
    uint32_t whstpos:12;
    uint32_t reserved0:4;
    uint32_t whsppos:12;
    };

typedef struct ltdc_l2whpcr ltdc_l2whpcr_t;
static_assert(sizeof(ltdc_l2whpcr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L2WVPCR register
 *
 * LTDC layer 2 window vertical position configuration register
 *
 *  @note offset: 0x10cUL
 *        width:  32 bits
 */
#define LTDC_L2WVPCR_REG  0x10cUL

/**
 * @brief LTDC L2WVPCR WVSTPOS field
 *
 * window vertical start position These bits configure the first visible line of the layer window. WVSTPOS[10:0] must be ≤ AAH[10:0] bits (programmed in LTDC_AWCR register).
 *
 * @note offset: 0x0UL
 *       width:  11
 *       access: read-write
 */
#define LTDC_L2WVPCR_WVSTPOS_SHIFT 0x0UL
#define LTDC_L2WVPCR_WVSTPOS_MASK (((1ULL << 11) - 1) << LTDC_L2WVPCR_WVSTPOS_SHIFT)
/**
 * @brief LTDC L2WVPCR WVSPPOS field
 *
 * window vertical stop position These bits configure the last visible line of the layer window. WVSPPOS[10:0] must be ≥ AVBP[10:0] bits + 1 (programmed in LTDC_BPCR register).
 *
 * @note offset: 0x10UL
 *       width:  11
 *       access: read-write
 */
#define LTDC_L2WVPCR_WVSPPOS_SHIFT 0x10UL
#define LTDC_L2WVPCR_WVSPPOS_MASK (((1ULL << 11) - 1) << LTDC_L2WVPCR_WVSPPOS_SHIFT)


