outpost-os/drv-stm32-ltdc/src/stm32_ltdc_defs.h
struct ltdc_l2wvpcr {
    uint32_t wvstpos:11;
    uint32_t reserved0:5;
    uint32_t wvsppos:11;
    };

typedef struct ltdc_l2wvpcr ltdc_l2wvpcr_t;
static_assert(sizeof(ltdc_l2wvpcr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L2CKCR register
 *
 * LTDC layer 2 color keying configuration register
 *
 *  @note offset: 0x110UL
 *        width:  32 bits
 */
#define LTDC_L2CKCR_REG  0x110UL

/**
 * @brief LTDC L2CKCR CKBLUE field
 *
 * color key blue value
 *
 * @note offset: 0x0UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_L2CKCR_CKBLUE_SHIFT 0x0UL
#define LTDC_L2CKCR_CKBLUE_MASK (((1ULL << 8) - 1) << LTDC_L2CKCR_CKBLUE_SHIFT)
/**
 * @brief LTDC L2CKCR CKGREEN field
 *
 * color key green value
 *
 * @note offset: 0x8UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_L2CKCR_CKGREEN_SHIFT 0x8UL
#define LTDC_L2CKCR_CKGREEN_MASK (((1ULL << 8) - 1) << LTDC_L2CKCR_CKGREEN_SHIFT)
/**
 * @brief LTDC L2CKCR CKRED field
 *
 * color key red value
 *
 * @note offset: 0x10UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_L2CKCR_CKRED_SHIFT 0x10UL
#define LTDC_L2CKCR_CKRED_MASK (((1ULL << 8) - 1) << LTDC_L2CKCR_CKRED_SHIFT)


struct ltdc_l2ckcr {
    uint32_t ckblue:8;
    uint32_t ckgreen:8;
    uint32_t ckred:8;
    };

typedef struct ltdc_l2ckcr ltdc_l2ckcr_t;
static_assert(sizeof(ltdc_l2ckcr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L2PFCR register
 *
 * LTDC layer 2 pixel format configuration register
 *
 *  @note offset: 0x114UL
 *        width:  32 bits
 */
#define LTDC_L2PFCR_REG  0x114UL

/**
 * @brief LTDC L2PFCR PF field
 *
 * pixel format These bits configure the pixel format
 *
 * @note offset: 0x0UL
 *       width:  3
 *       access: read-write
 */
#define LTDC_L2PFCR_PF_SHIFT 0x0UL
#define LTDC_L2PFCR_PF_MASK (((1ULL << 3) - 1) << LTDC_L2PFCR_PF_SHIFT)


struct ltdc_l2pfcr {
    uint32_t pf:3;
    };

typedef struct ltdc_l2pfcr ltdc_l2pfcr_t;
static_assert(sizeof(ltdc_l2pfcr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L2CACR register
 *
 * LTDC layer 2 constant alpha configuration register
 *
 *  @note offset: 0x118UL
 *        width:  32 bits
 */
#define LTDC_L2CACR_REG  0x118UL

/**
 * @brief LTDC L2CACR CONSTA field
 *
 * constant alpha These bits configure the constant alpha used for blending. The constant alpha is divided by 255 by hardware. Example: if the programmed constant alpha is 0xFF, the constant alpha value is 255 / 255 = 1.
 *
 * @note offset: 0x0UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_L2CACR_CONSTA_SHIFT 0x0UL
#define LTDC_L2CACR_CONSTA_MASK (((1ULL << 8) - 1) << LTDC_L2CACR_CONSTA_SHIFT)


struct ltdc_l2cacr {
    uint32_t consta:8;
    };

typedef struct ltdc_l2cacr ltdc_l2cacr_t;
static_assert(sizeof(ltdc_l2cacr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L2DCCR register
 *
 * LTDC layer 2 default color configuration register
 *
 *  @note offset: 0x11cUL
 *        width:  32 bits
 */
#define LTDC_L2DCCR_REG  0x11cUL

/**
 * @brief LTDC L2DCCR DCBLUE field
 *
 * default color blue These bits configure the default blue value.
 *
 * @note offset: 0x0UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_L2DCCR_DCBLUE_SHIFT 0x0UL
#define LTDC_L2DCCR_DCBLUE_MASK (((1ULL << 8) - 1) << LTDC_L2DCCR_DCBLUE_SHIFT)
/**
 * @brief LTDC L2DCCR DCGREEN field
 *
 * default color green These bits configure the default green value.
 *
 * @note offset: 0x8UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_L2DCCR_DCGREEN_SHIFT 0x8UL
#define LTDC_L2DCCR_DCGREEN_MASK (((1ULL << 8) - 1) << LTDC_L2DCCR_DCGREEN_SHIFT)
/**
 * @brief LTDC L2DCCR DCRED field
 *
 * default color red These bits configure the default red value.
 *
 * @note offset: 0x10UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_L2DCCR_DCRED_SHIFT 0x10UL
#define LTDC_L2DCCR_DCRED_MASK (((1ULL << 8) - 1) << LTDC_L2DCCR_DCRED_SHIFT)
/**
 * @brief LTDC L2DCCR DCALPHA field
 *
 * default color alpha These bits configure the default alpha value.
 *
 * @note offset: 0x18UL
 *       width:  8
 *       access: read-write
 */
#define LTDC_L2DCCR_DCALPHA_SHIFT 0x18UL
#define LTDC_L2DCCR_DCALPHA_MASK (((1ULL << 8) - 1) << LTDC_L2DCCR_DCALPHA_SHIFT)


struct ltdc_l2dccr {
    uint32_t dcblue:8;
    uint32_t dcgreen:8;
    uint32_t dcred:8;
    uint32_t dcalpha:8;
    };

typedef struct ltdc_l2dccr ltdc_l2dccr_t;
static_assert(sizeof(ltdc_l2dccr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L2BFCR register
 *
 * LTDC layer 2 blending factors configuration register
 *
 *  @note offset: 0x120UL
 *        width:  32 bits
 */
#define LTDC_L2BFCR_REG  0x120UL

/**
 * @brief LTDC L2BFCR BF2 field
 *
 * blending factor 2 These bits select the blending factor F2
 *
 * @note offset: 0x0UL
 *       width:  3
 *       access: read-write
 */
#define LTDC_L2BFCR_BF2_SHIFT 0x0UL
#define LTDC_L2BFCR_BF2_MASK (((1ULL << 3) - 1) << LTDC_L2BFCR_BF2_SHIFT)
/**
 * @brief LTDC L2BFCR BF1 field
 *
 * blending factor 1 These bits select the blending factor F1.
 *
 * @note offset: 0x8UL
 *       width:  3
 *       access: read-write
 */
#define LTDC_L2BFCR_BF1_SHIFT 0x8UL
#define LTDC_L2BFCR_BF1_MASK (((1ULL << 3) - 1) << LTDC_L2BFCR_BF1_SHIFT)


struct ltdc_l2bfcr {
    uint32_t bf2:3;
    uint32_t reserved0:5;
    uint32_t bf1:3;
    };

typedef struct ltdc_l2bfcr ltdc_l2bfcr_t;
static_assert(sizeof(ltdc_l2bfcr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L2CFBAR register
 *
 * LTDC layer 2 color frame buffer address register
 *
 *  @note offset: 0x12cUL
 *        width:  32 bits
 */
#define LTDC_L2CFBAR_REG  0x12cUL

/**
 * @brief LTDC L2CFBAR CFBADD field
 *
 * color frame buffer start address These bits define the color frame buffer start address.
 *
 * @note offset: 0x0UL
 *       width:  32
 *       access: read-write
 */
#define LTDC_L2CFBAR_CFBADD_SHIFT 0x0UL
#define LTDC_L2CFBAR_CFBADD_MASK (((1ULL << 32) - 1) << LTDC_L2CFBAR_CFBADD_SHIFT)


struct ltdc_l2cfbar {
    uint32_t cfbadd:32;
    };

typedef struct ltdc_l2cfbar ltdc_l2cfbar_t;
static_assert(sizeof(ltdc_l2cfbar_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L2CFBLR register
 *
 * LTDC layer 2 color frame buffer length register
 *
 *  @note offset: 0x130UL
 *        width:  32 bits
 */
#define LTDC_L2CFBLR_REG  0x130UL

/**
 * @brief LTDC L2CFBLR CFBLL field
 *
 * color frame buffer line length These bits define the length of one line of pixels in bytes + 3. The line length is computed as follows: active high width * number of bytes per pixel + 3.
 *
 * @note offset: 0x0UL
 *       width:  13
 *       access: read-write
 */
#define LTDC_L2CFBLR_CFBLL_SHIFT 0x0UL
#define LTDC_L2CFBLR_CFBLL_MASK (((1ULL << 13) - 1) << LTDC_L2CFBLR_CFBLL_SHIFT)
/**
 * @brief LTDC L2CFBLR CFBP field
 *
 * color frame buffer pitch in bytes These bits define the pitch that is the increment from the start of one line of pixels to the start of the next line in bytes.
 *
 * @note offset: 0x10UL
 *       width:  13
 *       access: read-write
 */
#define LTDC_L2CFBLR_CFBP_SHIFT 0x10UL
#define LTDC_L2CFBLR_CFBP_MASK (((1ULL << 13) - 1) << LTDC_L2CFBLR_CFBP_SHIFT)


struct ltdc_l2cfblr {
    uint32_t cfbll:13;
    uint32_t reserved0:3;
    uint32_t cfbp:13;
    };

typedef struct ltdc_l2cfblr ltdc_l2cfblr_t;
static_assert(sizeof(ltdc_l2cfblr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L2CFBLNR register
 *
 * LTDC layer 2 color frame buffer line number register
 *
 *  @note offset: 0x134UL
 *        width:  32 bits
 */
#define LTDC_L2CFBLNR_REG  0x134UL

/**
 * @brief LTDC L2CFBLNR CFBLNBR field
 *
 * frame buffer line number These bits define the number of lines in the frame buffer that corresponds to the active high width.
 *
 * @note offset: 0x0UL
 *       width:  11
 *       access: read-write
 */
#define LTDC_L2CFBLNR_CFBLNBR_SHIFT 0x0UL
#define LTDC_L2CFBLNR_CFBLNBR_MASK (((1ULL << 11) - 1) << LTDC_L2CFBLNR_CFBLNBR_SHIFT)


struct ltdc_l2cfblnr {
    uint32_t cfblnbr:11;
    };

typedef struct ltdc_l2cfblnr ltdc_l2cfblnr_t;
static_assert(sizeof(ltdc_l2cfblnr_t) == sizeof(uint32_t), "Invalid register description");

/**
 *  @brief LTDC L2CLUTWR register
 *
 * LTDC layer 2 CLUT write register
 *
 *  @note offset: 0x144UL
 *        width:  32 bits
 */
#define LTDC_L2CLUTWR_REG  0x144UL

/**
 * @brief LTDC L2CLUTWR BLUE field
 *
 * blue value These bits configure the blue value.
 *
 * @note offset: 0x0UL
 *       width:  8
 *       access: write-only
 */
#define LTDC_L2CLUTWR_BLUE_SHIFT 0x0UL
#define LTDC_L2CLUTWR_BLUE_MASK (((1ULL << 8) - 1) << LTDC_L2CLUTWR_BLUE_SHIFT)
/**
 * @brief LTDC L2CLUTWR GREEN field
 *
 * green value These bits configure the green value.
 *
 * @note offset: 0x8UL
 *       width:  8
 *       access: write-only
 */
#define LTDC_L2CLUTWR_GREEN_SHIFT 0x8UL
#define LTDC_L2CLUTWR_GREEN_MASK (((1ULL << 8) - 1) << LTDC_L2CLUTWR_GREEN_SHIFT)
/**
 * @brief LTDC L2CLUTWR RED field
 *
 * red value These bits configure the red value.
 *
 * @note offset: 0x10UL
 *       width:  8
 *       access: write-only
 */
#define LTDC_L2CLUTWR_RED_SHIFT 0x10UL
#define LTDC_L2CLUTWR_RED_MASK (((1ULL << 8) - 1) << LTDC_L2CLUTWR_RED_SHIFT)
/**
 * @brief LTDC L2CLUTWR CLUTADD field
 *
 * CLUT address These bits configure the CLUT address (color position within the CLUT) of each RGB value.
 *
 * @note offset: 0x18UL
 *       width:  8
 *       access: write-only
 */
#define LTDC_L2CLUTWR_CLUTADD_SHIFT 0x18UL
#define LTDC_L2CLUTWR_CLUTADD_MASK (((1ULL << 8) - 1) << LTDC_L2CLUTWR_CLUTADD_SHIFT)


