outpost-os/drv-stm32-ltdc/src/stm32_ltdc_defs.h
struct ltdc_l2clutwr {
    uint32_t blue:8;
    uint32_t green:8;
    uint32_t red:8;
    uint32_t clutadd:8;
    };

typedef struct ltdc_l2clutwr ltdc_l2clutwr_t;
static_assert(sizeof(ltdc_l2clutwr_t) == sizeof(uint32_t), "Invalid register description");

/*@

    predicate ltdc_is_writable_register(ℤ r) = (
        r == 0x8 ||
        r == 0xc ||
        r == 0x10 ||
        r == 0x14 ||
        r == 0x18 ||
        r == 0x24 ||
        r == 0x2c ||
        r == 0x34 ||
        r == 0x40 ||
        r == 0x84 ||
        r == 0x88 ||
        r == 0x8c ||
        r == 0x90 ||
        r == 0x94 ||
        r == 0x98 ||
        r == 0x9c ||
        r == 0xa0 ||
        r == 0xac ||
        r == 0xb0 ||
        r == 0xb4 ||
        r == 0x104 ||
        r == 0x108 ||
        r == 0x10c ||
        r == 0x110 ||
        r == 0x114 ||
        r == 0x118 ||
        r == 0x11c ||
        r == 0x120 ||
        r == 0x12c ||
        r == 0x130 ||
        r == 0x134 ||
        \false
    );

    predicate ltdc_is_readable_register(ℤ r) = (
        r == 0x8 ||
        r == 0xc ||
        r == 0x10 ||
        r == 0x14 ||
        r == 0x18 ||
        r == 0x24 ||
        r == 0x2c ||
        r == 0x34 ||
        r == 0x38 ||
        r == 0x40 ||
        r == 0x44 ||
        r == 0x48 ||
        r == 0x84 ||
        r == 0x88 ||
        r == 0x8c ||
        r == 0x90 ||
        r == 0x94 ||
        r == 0x98 ||
        r == 0x9c ||
        r == 0xa0 ||
        r == 0xac ||
        r == 0xb0 ||
        r == 0xb4 ||
        r == 0x104 ||
        r == 0x108 ||
        r == 0x10c ||
        r == 0x110 ||
        r == 0x114 ||
        r == 0x118 ||
        r == 0x11c ||
        r == 0x120 ||
        r == 0x12c ||
        r == 0x130 ||
        r == 0x134 ||
        \false
    );

    predicate ltdc_register_exists(ℤ r) = (
        r == 0x8 ||
        r == 0xc ||
        r == 0x10 ||
        r == 0x14 ||
        r == 0x18 ||
        r == 0x24 ||
        r == 0x2c ||
        r == 0x34 ||
        r == 0x38 ||
        r == 0x3c ||
        r == 0x40 ||
        r == 0x44 ||
        r == 0x48 ||
        r == 0x84 ||
        r == 0x88 ||
        r == 0x8c ||
        r == 0x90 ||
        r == 0x94 ||
        r == 0x98 ||
        r == 0x9c ||
        r == 0xa0 ||
        r == 0xac ||
        r == 0xb0 ||
        r == 0xb4 ||
        r == 0xc4 ||
        r == 0x104 ||
        r == 0x108 ||
        r == 0x10c ||
        r == 0x110 ||
        r == 0x114 ||
        r == 0x118 ||
        r == 0x11c ||
        r == 0x120 ||
        r == 0x12c ||
        r == 0x130 ||
        r == 0x134 ||
        r == 0x144 ||
        \false
    );


*/

#endif /* __STM32U599_LTDC_DEFS_H */
